{
    "profileSummary": {
        "title": "Career Summary",
        "summary": "Software Developer with over 5 years of working experience in several large organizations in the public sector and e-commerce industry. Developed features used by thousands / millions of users in different jobs. Familiar with both front-end and back-end development using JavaScript and Java."
    },
    "education": {
        "title": "Education",
        "info": [
            {
                "degree": "BBA (Information Systems)",
                "university": "The University of Hong Kong",
                "time": "Sep 2012 – Nov 2017",
                "details": "Majors: Information Systems & Computer Science | Minor: Economics \nSecond Class Honors – Division One"
            }
        ]
    },
    "technicalWorkingExperiences": {
        "title": "Technical Work Experiences",
        "info": [
            {
                "role": "Analyst Programmer",
                "company": "Electrical and Mechanical Services Department, HKSARG",
                "time": "25 Aug 2021 – 28 Aug 2023",
                "details": [
                    "Developed and enhanced Job Management, Vendor Portal and other systems supporting over 5,000 users and managing over 1 million pieces of equipment.",
                    "Responsible for the full-stack web development (more backend focused) using Nodejs, MongoDB, Express, Angular.",
                    "Developed 100+ API endpoints and composed relevant documentation.",
                    "Followed Scrum and Git-flow to collaborate with BA, QA and other developers to hold weekly sprint planning and review. Coordinated and tracked the project using Azure Devops.",
                    "Developed features like Preventive Maintenance (PM), Stock Reservation, Batch Timesheet Submission, etc. Enabled users to complete over 10, 000 maintenance jobs within 1 year after the launch of PM feature."
                ]
            },
            {
                "role": "Analyst Programmer",
                "company": "Elee Consulting Limited (Deployed to Hospital Authority)",
                "time": "17 Aug 2020 – 5 May 2021",
                "details": [
                    "Enhanced Budget Planning System for Hospital Authority.",
                    "Developed the front end of the new features using technologies like react, redux, material UI, etc. The website in this project consists of many forms and excel-like spreadsheets which were created using Handsontable.js."
                ]
            },
            {
                "role": "Programmer",
                "company": "Hong Kong Television Network Limited",
                "time": "15 Feb 2019 – 9 Aug 2020",
                "details": [
                    "Developed new features for HKTVMall e-commerce website, which is used by over 1 million users and sells over 1 million products simultaneously, using React, TypeScript, JavaScript, HTML5, CSS, JSP, etc.",
                    "Enhanced and maintained the desktop web, mobile web and web views inside apps for different systems in HKTV."
                ]
            },
            {
                "role": "Junior Associate",
                "company": "Azeus Systems Limited",
                "time": "1 Mar 2017 – 29 Jan 2019",
                "details": [
                    "Coordinated Electronic Record Keeping System project in the Civil Engineering & Development Department in the Hong Kong government. Met with external clients weekly to report project progress and prepared meeting minutes. Provided help desk support and user training.",
                    "Reported bugs and production issues to the offshore development team. Tested the bug-fixes and new system features. Prepared user manuals of the system.",
                    "Enhanced the Procurement and Contracts Management Systems using Java Technologies (e.g. JavaFX, JSP). Developed a desktop application for certificate upload."
                ]
            }
        ]
    },
    "canadaWorkingExperiences": {
        "title": "Canada Work Experiences",
        "info": [
            {
                "role": "Cargo Handler",
                "company": "Menzies Aviation Limited, Canada",
                "time": "20 Jun 2024 – 14 Nov 2025",
                "details": [
                    "Handled tons of cargo per working day in Menzies warehouse at the airport.",
                    "Processed customers’ cargo drop-off or pick-up requests. Weighed, measured, counted, inspected and recorded incoming cargo. Retrieved the requested cargo from the recorded warehouse location to customers using a forklift.",
                    "Conducted routine forklift inspections and replaced their propane gas when needed.",
                    "Built up secured cargo dropped from truck drivers to different ULDs for export via flight. Weighed the built ULDs and prepared relevant export documents such as load sheets.",
                    "Performed cargo breakdown after receiving imports from flights. Moved it to skids/pallets and packaged it for temporary storage in our warehouse and waiting for pickup by truck drivers.",
                    "Maintained work areas cleanliness, safety and security. Made workplaces hazard free of foreign object debris."
                ]
            },
            {
                "role": "Pet Sitter (Freelance)",
                "company": "Rover, Canada",
                "time": "05 Feb 2024 – 20 July 2025",
                "details": [
                    "Provided dogs boarding services to 30+ clients. Provided daily care for dogs of various breeds, sizes, and temperaments.",
                    "Managed feeding schedules, fresh water, walks, exercise routines and hygienic needs. Administered medications and followed special dietary or medical instructions.",
                    "Maintained strong communication with pet owners, including regular updates and photos."
                ]
            }
        ]
    },
    "onlineCertificates": {
        "title": "Online Certificates",
        "info": [
            {
                "name": "JavaScript (Intermediate) from Hackerrank",
                "link": "https://www.hackerrank.com/certificates/4ce1c41a05bd"
            },
            {
                "name": "Problem Solving (Intermediate)",
                "link": "https://www.hackerrank.com/certificates/bda5783abac3"
            },
            {
                "name": "SQL (Intermediate)",
                "link": "https://www.hackerrank.com/certificates/84b3ae47cfcc"
            }
        ]
    },
    "languages": {
        "title": "Languages",
        "info": [
            {
                "language": "English ",
                "level": "Fluent"
            },
            {
                "language": "Cantonese ",
                "level": "Native"
            },
            {
                "language": "Mandarin ",
                "level": "Moderate"
            }
        ]
    },
    "sidebar": {
        "name": "James Fung",
        "tagline": "Full Stack Software Developer",
        "email": "jamesfungtl@gmail.com",
        "linkedin": "tai-leung-fung-66103466",
        "github": "jamesfungtl"
    }
}